In [2]:
import numpy as np
import pandas as pd

In [3]:
melon_dataset_path = 'MelonDataset2alpha.csv'

In [4]:
melon_df = pd.read_csv(filepath_or_buffer=melon_dataset_path, index_col=False, header=0)

In [5]:
print(melon_df)

     色泽   根蒂   敲声   纹理   脐部   触感 好瓜
0   NaN   蜷缩   浊响   清晰   凹陷   硬滑  是
1    乌黑   蜷缩   沉闷   清晰   凹陷  NaN  是
2    乌黑   蜷缩  NaN   清晰   凹陷   硬滑  是
3    青绿   蜷缩   沉闷   清晰   凹陷   硬滑  是
4   NaN   蜷缩   浊响   清晰   凹陷   硬滑  是
5    青绿   稍蜷   浊响   清晰  NaN   软粘  是
6    乌黑   稍蜷   浊响   稍糊   稍凹   软粘  是
7    乌黑   稍蜷   浊响  NaN   稍凹   硬滑  是
8    乌黑  NaN   沉闷   稍糊   稍凹   硬滑  否
9    青绿   硬挺   清脆  NaN   平坦   软粘  否
10   浅白   硬挺   清脆   模糊   平坦  NaN  否
11   浅白   蜷缩  NaN   模糊   平坦   软粘  否
12  NaN   稍蜷   浊响   稍糊   凹陷   硬滑  否
13   浅白   稍蜷   沉闷   稍糊   凹陷   硬滑  否
14   乌黑   稍蜷   浊响   清晰  NaN   软粘  否
15   浅白   蜷缩   浊响   模糊   平坦   硬滑  否
16   青绿  NaN   沉闷   稍糊   稍凹   硬滑  否

In [20]:
sub_df = melon_df.loc[[11,2,5],["敲声","色泽","好瓜"]]
sub_df

     敲声  色泽 好瓜
11  NaN  浅白  否
2   NaN  乌黑  是
5    浊响  青绿  是

In [43]:
sub_df = melon_df.iloc[1:3.append(2:2),2:5]
sub_df

SyntaxError: invalid syntax (3881347743.py, line 1)

In [35]:
a= [i+2 for i in range(3)]
b= [i for i in range(3)]
print(a)
print(b)
a.extend(b)
print(a)
sub_df = melon_df.iloc[a,a]

[2, 3, 4]
[0, 1, 2]
[2, 3, 4, 0, 1, 2]

In [36]:
print(sub_df)

    敲声  纹理  脐部   色泽  根蒂   敲声
2  NaN  清晰  凹陷   乌黑  蜷缩  NaN
3   沉闷  清晰  凹陷   青绿  蜷缩   沉闷
4   浊响  清晰  凹陷  NaN  蜷缩   浊响
0   浊响  清晰  凹陷  NaN  蜷缩   浊响
1   沉闷  清晰  凹陷   乌黑  蜷缩   沉闷
2  NaN  清晰  凹陷   乌黑  蜷缩  NaN

In [11]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

ages = pd.Series([22, 35, 58], name="Age")

In [14]:
print(df)
print(ages)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
0    22
1    35
2    58
Name: Age, dtype: int64

In [15]:
df['Age'].describe()

count     3.000000
mean     38.333333
std      18.230012
min      22.000000
25%      28.500000
50%      35.000000
75%      46.500000
max      58.000000
Name: Age, dtype: float64

In [16]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [37]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [40]:
df = df.rename(columns={"Name":"SB"})
df

                         SB  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [51]:
agre_df = df.append({"SB":'sb',"Age":"12", "Seex":"mail"}, ignore_index=True)
agre_df

C:\Users\35058\AppData\Local\Temp\ipykernel_6932\3256993778.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  agre_df = df.append({"SB":'sb',"Age":"12", "Seex":"mail"}, ignore_index=True)

                         SB Age     Sex  Seex
0   Braund, Mr. Owen Harris  22    male   NaN
1  Allen, Mr. William Henry  35    male   NaN
2  Bonnell, Miss. Elizabeth  58  female   NaN
3                        sb  12     NaN  mail

In [54]:
agre_df["agee"] = agre_df["Sex"]
agre_df

                         SB Age     Sex  Seex    agee
0   Braund, Mr. Owen Harris  22    male   NaN    male
1  Allen, Mr. William Henry  35    male   NaN    male
2  Bonnell, Miss. Elizabeth  58  female   NaN  female
3                        sb  12     NaN  mail     NaN

In [60]:
agre_df["agee"] = agre_df["Age"]*10
agre_df

                         SB Age     Sex  Seex                  agee
0   Braund, Mr. Owen Harris  22    male   NaN                   220
1  Allen, Mr. William Henry  35    male   NaN                   350
2  Bonnell, Miss. Elizabeth  58  female   NaN                   580
3                        sb  12     NaN  mail  12121212121212121212

In [75]:
k = agre_df.loc[:,["Age","agee"]].median()
print(list(k))

[28.5, 465.0]

In [70]:
print(type(agre_df.loc[3,"agee"]))

<class 'str'>

In [6]:
print(melon_df.to_string())

     色泽   根蒂   敲声   纹理   脐部   触感 好瓜
0   NaN   蜷缩   浊响   清晰   凹陷   硬滑  是
1    乌黑   蜷缩   沉闷   清晰   凹陷  NaN  是
2    乌黑   蜷缩  NaN   清晰   凹陷   硬滑  是
3    青绿   蜷缩   沉闷   清晰   凹陷   硬滑  是
4   NaN   蜷缩   浊响   清晰   凹陷   硬滑  是
5    青绿   稍蜷   浊响   清晰  NaN   软粘  是
6    乌黑   稍蜷   浊响   稍糊   稍凹   软粘  是
7    乌黑   稍蜷   浊响  NaN   稍凹   硬滑  是
8    乌黑  NaN   沉闷   稍糊   稍凹   硬滑  否
9    青绿   硬挺   清脆  NaN   平坦   软粘  否
10   浅白   硬挺   清脆   模糊   平坦  NaN  否
11   浅白   蜷缩  NaN   模糊   平坦   软粘  否
12  NaN   稍蜷   浊响   稍糊   凹陷   硬滑  否
13   浅白   稍蜷   沉闷   稍糊   凹陷   硬滑  否
14   乌黑   稍蜷   浊响   清晰  NaN   软粘  否
15   浅白   蜷缩   浊响   模糊   平坦   硬滑  否
16   青绿  NaN   沉闷   稍糊   稍凹   硬滑  否

In [13]:
t =  melon_df.groupby("好瓜").
list(t)

[('否',
       色泽   根蒂   敲声   纹理   脐部   触感 好瓜
  8    乌黑  NaN   沉闷   稍糊   稍凹   硬滑  否
  9    青绿   硬挺   清脆  NaN   平坦   软粘  否
  10   浅白   硬挺   清脆   模糊   平坦  NaN  否
  11   浅白   蜷缩  NaN   模糊   平坦   软粘  否
  12  NaN   稍蜷   浊响   稍糊   凹陷   硬滑  否
  13   浅白   稍蜷   沉闷   稍糊   凹陷   硬滑  否
  14   乌黑   稍蜷   浊响   清晰  NaN   软粘  否
  15   浅白   蜷缩   浊响   模糊   平坦   硬滑  否
  16   青绿  NaN   沉闷   稍糊   稍凹   硬滑  否),
 ('是',
      色泽  根蒂   敲声   纹理   脐部   触感 好瓜
  0  NaN  蜷缩   浊响   清晰   凹陷   硬滑  是
  1   乌黑  蜷缩   沉闷   清晰   凹陷  NaN  是
  2   乌黑  蜷缩  NaN   清晰   凹陷   硬滑  是
  3   青绿  蜷缩   沉闷   清晰   凹陷   硬滑  是
  4  NaN  蜷缩   浊响   清晰   凹陷   硬滑  是
  5   青绿  稍蜷   浊响   清晰  NaN   软粘  是
  6   乌黑  稍蜷   浊响   稍糊   稍凹   软粘  是
  7   乌黑  稍蜷   浊响  NaN   稍凹   硬滑  是)]

In [16]:
melon_df.columns

Index(['色泽', '根蒂', '敲声', '纹理', '脐部', '触感', '好瓜'], dtype='object')

In [19]:
melon_df.value_counts()

色泽  根蒂  敲声  纹理  脐部  触感  好瓜
乌黑  稍蜷  浊响  稍糊  稍凹  软粘  是     1
浅白  稍蜷  沉闷  稍糊  凹陷  硬滑  否     1
    蜷缩  浊响  模糊  平坦  硬滑  否     1
青绿  蜷缩  沉闷  清晰  凹陷  硬滑  是     1
dtype: int64

In [20]:
list(melon_df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]